app/views/questions/change.html.erb

SELECT "answers".* FROM "answers" WHERE (question = 1)
---
  <br>
  <% answers  = Answer.where(:question => @question.id)%>