app/views/survey/limit.html.erb

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]
---
		<% id = Integer(index)%>
		<% answer = Answer.find(id)%>

SELECT "resources".* FROM "resources" WHERE "resources"."answer_id" = 1
---
		<%if answer.resource_bool == true%>
			<%resourceArr = Resources.where(:answer_id => answer.id)%>