app/views/survey/physician.html.erb

		<% id = Integer(index)%>
		<% answer = Answer.find(id)%>
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 6]]