app/controllers/login_controller.rb

INSERT INTO "patients" ("answers", "created_at", "updated_at") VALUES (?, ?, ?)  [["answers", ""], ["created_at", Mon, 15 Oct 2012 05:49:59 UTC +00:00], ["updated_at", Mon, 15 Oct 2012 05:49:59 UTC +00:00]]
---
  def main
  	patient = Patient.new
  	#patient.start = Time.now.to_i
  	patient.answers = ""
  	patient.save