app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 2]]
INSERT INTO "answers" ("created_at", "followup", "hasfq", "question", "reply", "resource", "resource_bool", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def save

    id = params[:id].to_i
    question = Question.find(id)

    answerArr = Answer.where("question = ?", question.id)
    if answerArr.any?
      answerArr.each do |a|
        Answer.destroy(a.id)
      end
    end
    newAttr = Hash.new

    newAttr[:ask] = params[:quest]
    newAttr[:order] = params[:order]


    if (params[:answer1].length > 0)
      answer1 = Answer.new
      answer1.reply = params[:answer1]
      answer1.question = question.id
      newAttr[:a1] = answer1.id
      if params[:answer1_follow] == "yes"
        answer1.hasfq = true
        answer1.save

UPDATE "questions" SET "ask" = 'Are you okay?', "updated_at" = '2012-10-23 06:01:15.816074' WHERE "questions"."id" = 1
---
        resource8.save
      end
    end
    Question.update(id, newAttr)

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]
---
  def change
    id = params[:id].to_i
    @question = Question.find(id)

DELETE FROM "questions" WHERE "questions"."id" = ?  [["id", 1]]
---
  def delete
    id = params[:id].to_i
    Question.destroy(id)

INSERT INTO "questions" ("a1", "a2", "a3", "a4", "ask", "category", "created_at", "follow", "follows", "language", "order", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "answers" ("created_at", "followup", "hasfq", "question", "reply", "resource", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Mon, 17 Sep 2012 23:42:16 UTC +00:00], ["followup", nil], ["hasfq", nil], ["question", 1], ["reply", "Yes"], ["resource", nil], ["updated_at", Mon, 17 Sep 2012 23:42:16 UTC +00:00]]
---
  def add
    @language = params[:language]
    question = Question.new
    question.follow = params[:follow]
    question.follows = params[:follows]
  	question.ask = params[:quest]
    question.order = params[:order]
    question.category = params[:category]
    question.language = params[:language]
  	question.save
    if params[:followUps] != nil
      followUps = JSON.parse(params[:followUps])
    else
      question.follow = false
      followUps = Array.new
    end
    if (params[:answer1].length > 0)
      answer1 = Answer.new
      answer1.reply = params[:answer1]
      answer1.question = question.id
      question.a1 = answer1.id
      if params[:answer1_follow] == "yes"
        answer1.hasfq = true
        answer1.save

INSERT INTO "resources" ("address1", "address2", "answer_id", "city", "created_at", "gmaps", "instructions", "latitude", "longitude", "name", "phone1", "phone2", "phone3", "updated_at", "website", "zipcode") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "answers" SET "resource_bool" = 'f', "updated_at" = '2012-09-28 05:00:23.468028' WHERE "answers"."id" = 3
---
      else
        answer1.resource_bool = false
      end
      answer1.save

UPDATE "questions" SET "a1" = 5, "a2" = 6, "a3" = 7, "a4" = 8, "updated_at" = '2012-09-08 21:26:52.179952' WHERE "questions"."id" = 3
---
        resource8.save
      end
    end
  	question.save