app/controllers/survey_controller.rb

  def physician
    @patient = params[:patient]
    @language = params[:language]
    history = Patient.find(@patient)
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "13"]]

  def view
    @language = params[:language]
  	@number = params[:number].to_i
    id = params[:patient].to_i
    @patient_id = id
    patient = Patient.find(id)
    answerSoFar = patient.answers
    answerSoFar += ":" + params[:answer]
    patient.answers = answerSoFar
    patient.language = @language
    patient.save
  	if params[:follow] == "false"
  		@number += 1
  		questionArr = nil
      logger.debug "Order number: #{@number}"
  		questionArr = Question.where(:order => @number, :follow => false, :language => @language)
  		if questionArr.any?
  			@question = questionArr[0]
  			@answers = Answer.where(:question => @question.id)
  		else
  			redirect_to :controller => "survey", :action => "limit", :patient => params[:patient], :language => params[:language]
  		end
  	else
  		answer = params[:answer].to_i
      logger.debug "Order number: #{answer}"
  		questionArr = nil
  		questionArr = Question.where(:follows => answer, :follow => true, :language => @language)
  		if questionArr.any?
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", 0]]
UPDATE "patients" SET "answers" = 'start:cougar0', "updated_at" = '2012-10-15 05:58:30.442581' WHERE "patients"."id" = 4
SELECT "questions".* FROM "questions" WHERE "questions"."order" = 1 AND "questions"."follow" = 'f' AND "questions"."language" = 'Spanish'
SELECT "questions".* FROM "questions" LIMIT 1
SELECT COUNT(*) FROM "questions" WHERE "questions"."order" = 1 AND "questions"."follow" = 'f' AND "questions"."language" = 'English'
SELECT "answers".* FROM "answers" WHERE "answers"."question" = 1
SELECT "questions".* FROM "questions" WHERE "questions"."follows" = 1 AND "questions"."follow" = 't'
SELECT COUNT(*) FROM "questions" WHERE "questions"."follows" = 1 AND "questions"."follow" = 't'

  def limit
    @patient = params[:patient]
    @language = params[:language]
    history = Patient.find(@patient)
    history.exit = Time.now.to_i
    history.save
    answers = history.answers
    @numbers = answers.split(%r{:\s*})
    @numbers.delete("0")
    @numbers.delete("")
    questions = Question.where(:language => @language)
    @response = {"language"=> @language}
    questions.each do |q|
      @response[q.id] = ""
    end
    @numbers.each do |index|
      id = Integer(index)
      answer = Answer.find(id)
---
SELECT "patients".* FROM "patients" WHERE "patients"."id" = ? LIMIT 1  [["id", "4"]]
SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", 1]]

  def map
    @patient_id = params[:patient]
    @number = params[:number].to_i
    answerArr = Answer.where(:id => params[:answer])
    @answer = answerArr[0]
    resourceArr = Resources.where(:answer_id => @answer.id)
---
SELECT "answers".* FROM "answers" WHERE "answers"."id" = 3
SELECT "resources".* FROM "resources" WHERE "resources"."answer_id" = 1